{
  "navbar":{
    "experience": "Experiencia",
    "projects": "Proyectos",
    "studies": "Estudios",
    "download": "Descargar CV"
  },
  "tec":{
    "mongodb1": "MongoDB es una base de datos de documentos que ofrece una gran escalabilidad y flexibilidad, y un modelo de consultas e indexación avanzado.",
    "mongodb2": "MongoDB es de uso gratuito.",
    "express": "Texto de prueba de ."
  },
  "info-exp":{
    "full": "Desarrollador Full Stack",
    "front": "Desarrollador Front-End",
    "back": "Desarrollador Back-End",
    "support": "Especialista de Soporte"
  },
  "nttdata":{
    "date": "Julio 2021 - Presente",
    "desc1": "NTT DATA, parte de NTT Group, es uno de los 10 principales proveedores de servicios de TI a nivel mundial.",
    "desc2": "Ofrecen servicios de consultoría, soluciones industriales, servicios de procesos de negocio, modernización de TI y servicios gestionados.",
    "task1": "Desarrollo deL backend haciendo uso de Java Spring",
    "task2": "Creación, mantenimiento y mejora de diversos componentes para el front-end haciendo uso de Angular13",
    "task3": "Desarrollo de microservicios haciendo uso de Java Spring Boot",
    "task4": "Gestión de contenedores haciendo uso de Docker",
    "task5": "Creación y mantenimiento de diversos componentes para el front-end haciendo uso de Angular13",
    "task6": "Creación de microservicios haciendo uso de node js con funciones lambda - AWS",
    "task7": "Gestión de bases de datos MySQL con el servicio RDS - AWS",
    "task8": "Agregando módulos para el front-end haciendo uso de Lit-Html (JS)",
    "task9": "Recreación del front-end del sistema silverlight haciendo uso de Angular11",
    "task10": "Test de módulos haciendo uso de jest.js",
    "task11": "Consumo de API REST"
  },
  "renfe":{
    "date": "Noviembre 2022 - presente",
    "desc1": "Plataforma de administración de las vías ferroviarias y trenes de España, incluyendo rutas, cargas, estaciones, etc.",
    "desc2": "Tecnologías usadas: Java Spring - Angular13.",
    "task1": "Desarrollo deL backend haciendo uso de Java Spring",
    "task2": "Creación, mantenimiento y mejora de diversos componentes para el front-end haciendo uso de Angular13"
  },
  "datadis":{
    "date": "Febrero 2022 - Octubre 2022",
    "desc1": "Es una plataforma de datos de consumo eléctrico que permite al administrador ver, agregar, editar y eliminar diversas empresas y sus consumos eléctricos a una base de datos mediante una API y a los usuarios en general verificar el consumo eléctrico en diversos periodos de tiempo.",
    "desc2": "Tecnologías usadas: Java Spring Boot - Docker - Angular13.",
    "task1": "Desarrollo de microservicios haciendo uso de Java Spring Boot",
    "task2": "Gestión de contenedores haciendo uso de Docker",
    "task3": "Creación, mantenimiento y mejora de diversos componentes para el front-end haciendo uso de Angular13"
  },
  "ree":{
    "date": "Diciembre 2021 - Enero 2022",
    "desc1": "Sistema administrativo y dashboard para la red eléctrica de España.",
    "desc2": "El sistema permite a la población en general verificar su consumo eléctrico mediante diversos gráficos.",
    "desc3": "Tecnologías usadas: Node js - lambda(AWS) -  RDS(AWS) - MySQL - LitHtml(JS).",
    "task1": "Creación microservicios haciendo uso de node js con funciones lambda - AWS",
    "task2": "Gestión de bases de datos MySQL con el servicio RDS - AWS",
    "task3": "Agregando módulos para el front-end haciendo uso de Lit-Html (JS)"
  },
  "ibost":{
    "date": "Julio 2021 - Noviembre 2021",
    "desc1": "El proyecto consistía en la migración de un sistema basado en Silverlight a un nuevo proyecto usando la tecnología Angular11.",
    "desc2": "iBost es una empresa que se dedica a la distribución de diversas resistencias eléctricas y su sistema requería una administración de pedidos y clientes.",
    "desc3": "Tecnologías usadas: jest.js - API REST - Angular11.",
    "task1": "Recreación del front-end del sistema silverlight haciendo uso de Angular11",
    "task2": "Test de módulos haciendo uso de jest.js",
    "task3": "Consumo de API REST"
  },
  "adiasoft":{
    "date": "Enero 2022 - Abril 2022",
    "desc1": "Es un Software de ventas entorno ERP, para una gestión automatizada y administrativa para pequeñas y medianas empresas.",
    "desc2": "El proyecto consistía en crear una plataforma orientada a la facturación electrónica que se pueda integrar tanto en los sistemas antiguos como en los actuales.",
    "desc3": "Tecnologías usadas: Java Spring Boot - React - SQL server.",
    "task1": "Adaptación de un sistemas de Facturación Electrónica haciendo uso de React",
    "task2": "Desarrollo API REST con Java Spring Boot",
    "task3": "Creación de tablas, triggers e índices SQL server"
  },
  "webControl":{
    "date": "Septiembre 2020 - Julio 2021",
    "desc1": "WebControl System es una empresa del área de tecnologías de la información, principalmente orientada a empresas de minería.",
    "desc2": "El sistema está orientado a la gestión del negocio, proporcionando herramientas como reportes, control de envíos, Kardex, CRUDs, etc.",
    "desc3": "Tecnologías usadas: Visual Basic Script - ASP.NET - SQL server - .NET CORE.",
    "task1": "Administración de bases de datos usando SQL Server",
    "task2": "Desarrollo Front-End haciendo uso de VBScript / ASP.NET",
    "task3": "Desarrollo Back-End API REST con .NET CORE"
  },
  "orooplex":{
    "date": "Septiembre 2019 - Agosto 2020",
    "desc1": "Orooplex es un servicio web orientado a anuncios empresariales, publicidad y marketing digital.",
    "desc2": "Tecnologías usadas: React - Angular - Node.Js - Express - MySQL.",
    "task1": "Creación de paginas web enfocadas a la publicidad y el marketing",
    "task2": "Desarrollo Front-End haciendo uso de React / Angular",
    "task3": "Desarrollo Back-End API REST con MySQL / Express / Node.Js"
  },
  "frs":{
    "date": "Enero 2020 - Abril 2020",
    "desc1": "Francisco Rojas School es una institución educativa particular.",
    "desc2": "El especialista de soporte se encarga de publicidad, mantenimiento y desarrollo de la pagina web de la institución y mantenimiento de los equipos digitales en la instalación.",
    "desc3": "Tecnologías usadas: wordpress - Adobe Illustrator - Adobe Photoshop",
    "task1": "Creación de las diversas publicidades y anuncios de la institución haciendo uso de Adobe Illustrator y Photoshop",
    "task2": "Administración y creación de componentes de la pagina web haciendo uso de Wordpress",
    "task3": "Mantenimiento de dispositivos digitales de las instalaciones"
  },
  "andromeda":{
    "date": "Febrero 2019 - Agosto 2019",
    "desc1": "Andromeda.Pe es una empresa que se dedica al desarrollo de aplicaciones web mayormente orientadas a la facturación electrónica.",
    "desc2": "Tecnologías usadas: Laravel - MySQL",
    "task1": "conexión con API de SUNAT para el CRUD de boletas y facturas en su sistema",
    "task2": "Administración de bases de datos haciendo uso de MySQL",
    "task3": "Creación y mantenimiento de lógica de negocio haciendo uso de Laravel - php"
  },
  "auditel":{
    "date": "Diciembre 2018 - Febrero 2019",
    "desc1": "Auditel es un mayorista en telecomunicaciones y seguridad.",
    "desc2": "Implementa hardware y software de seguridad a diversas instituciones.",
    "desc3": "Tecnologías usadas: React - Express - Node.Js - MongoDB",
    "task1": "Creación de una pagina web en la que alumnos podrán realizar diversas acciones como ver notas, registrar entradas, ver mensajes, etc ",
    "task2": "Creación de diversos componentes usando React",
    "task3": "Creación de lógica de negocio haciendo uso de Express",
    "task4": "Administración de bases de datos haciendo uso de MySQL"
  }
}
